import streamlit as st

# 1. ตั้งค่าหัวข้อของหน้าเว็บและไอคอนบนแท็บเบราว์เซอร์
st.set_page_config(page_title="พอร์ตโฟลิโอของฉัน", page_icon="📝", layout="centered")
# 2. ส่วนหัวข้อเด่นและข้อมูลส่วนตัว (Header Section)
st.title("สวัสดีครับ/ค่ะ ยินดีต้อนรับสู่เว็บของฉัน 👋")
st.subheader("ฉันเป็นนักพัฒนาโปรแกรมที่หลงใหลในการเขียน Python")
st.write("---") # เส้นคั่นแบ่งส่วน.

st.write("---") # เส้นคั่นแบ่งส่วน
st.write("---") # เส้นคั่นแบ่งส่วน
st.write("---") # เส้นคั่นแบ่งส่วน
st.write("---") # เส้นคั่นแบ่งส่วน
st.write("---") # เส้นคั่นแบ่งส่วน
st.write("---") # เส้นคั่นแบ่งส่วน
st.write("---") # เส้นคั่นแบ่งส่วน
st.write("---") # เส้นคั่นแบ่งส่วน
st.write("---") # เส้นคั่นแบ่งส่วน
st.write("---") # เส้นคั่นแบ่งส่วน
st.write("---") # เส้นคั่นแบ่งส่วน